library("readxl")
library("tidyverse")
library("writexl")
library("scales")

setwd("C:/Users/hsien/Desktop/table220113")

countycode<-c(10002,10004,10005,10007,10008,10009,10010,10013,
              10014,10015,10016,10017,10018,10020,63000,64000,
              65000,66000,67000,68000,90070,90200 )
countyname<-c("宜蘭縣","新竹縣","苗栗縣","彰化縣","南投縣","雲林縣",
              "嘉義縣","屏東縣","臺東縣","花蓮縣","澎湖縣","基隆市",
              "新竹市","嘉義市","臺北市","高雄市","新北市","臺中市",
              "臺南市","桃園市","連江縣","金門縣")

towncode<-c(09007010,09007020,09007030,09007040,09020010,09020020,09020030,09020040,09020050,09020060,10002010,10002020,10002030,10002040,10002050,10002060,10002070,10002080,10002090,10002100,10002110,10002120,10004010,10004020,10004030,10004040,10004050,10004060,10004070,10004080,10004090,10004100,10004110,10004120,10004130,10005010,10005020,10005030,10005040,10005050,10005060,10005070,10005080,10005090,10005100,10005110,10005120,10005130,10005140,10005150,10005160,10005170,10005180,
            10007010, 10007020, 10007030, 10007040, 10007050,10007060,10007070, 10007080,10007090,10007100,10007110,10007120,10007130,10007140,10007150,10007160,10007170,10007180,10007190,10007200,10007210,10007220,10007230,10007240,10007250,10007260, 10008010, 10008020, 10008030, 10008040, 10008050, 10008060, 10008070, 10008080, 10008090, 10008100, 10008110, 10008120, 10008130,10009010,10009020, 10009030, 10009040, 10009050, 10009060,10009070, 10009080, 10009090, 10009100, 10009110, 10009120, 10009130, 10009140, 10009150, 10009160,10009170, 10009180, 10009190, 10009200,
            10010010, 10010020, 10010030, 10010040, 10010050, 10010060, 10010070, 10010080, 10010090, 10010100, 10010110, 10010120, 10010130, 10010140, 10010150, 10010160, 10010170, 10010180,10013010, 10013020, 10013030, 10013040, 10013050, 10013060, 10013070, 10013080, 10013090, 10013100, 10013110, 10013120, 10013130, 10013140, 10013150, 10013160, 10013170, 10013180, 10013190, 10013200, 10013210, 10013220, 10013230, 10013240, 10013250, 10013260,10013270, 10013280, 10013290,10013300,10013310, 10013320, 10013330,10014010,10014020, 10014030, 10014040, 10014050, 10014060, 10014070, 10014080, 10014090, 10014100, 10014110, 10014120, 10014130, 10014140, 10014150,10014160,10015010, 10015020, 
            10015030, 10015040, 10015050, 10015060, 10015070, 10015080, 10015090, 10015100,10015110, 10015120, 10015130,10016010, 10016020, 10016030, 10016040, 10016050, 10016060,10017010, 10017020, 10017030, 10017040, 10017050, 10017060, 10017070, 10018010, 10018020, 10018030, 10020010,10020020,63000010, 63000020, 63000030, 63000040, 63000050,63000060, 63000070, 63000080, 63000090,63000100, 63000110, 63000120, 
            64000010, 64000020, 64000030, 64000040, 64000050, 64000060, 64000070, 64000080, 64000090, 64000100, 64000110, 64000120, 64000130, 64000140,64000150, 64000160, 64000170, 64000180, 64000190, 64000200, 64000210, 64000220, 64000230, 64000240, 64000250, 64000260,64000270, 64000280, 64000290, 64000300, 64000310, 64000320,64000330, 64000340, 64000350, 64000360, 64000370, 64000380, 
            65000010, 65000020, 65000030, 65000040, 65000050, 65000060, 65000070, 65000080, 65000090, 65000100, 65000110, 65000120, 65000130, 65000140, 65000150, 65000160, 65000170, 65000180,65000190, 65000200, 65000210, 65000220, 65000230, 65000240, 65000250, 65000260, 65000270, 65000280, 65000290, 66000010, 66000020, 66000030, 66000040, 66000050, 66000060, 66000070, 66000080, 66000090, 66000100, 66000110, 66000120, 66000130,66000140, 66000150,66000160, 66000170, 66000180, 66000190, 66000200, 66000210, 66000220, 66000230, 66000240,66000250, 66000260, 66000270, 66000280,66000290, 
            67000010, 67000020, 67000030, 67000040, 67000050, 67000060, 67000070, 67000080, 67000090, 67000100, 67000110, 67000120, 67000130, 67000140, 67000150, 67000160, 67000170, 67000180, 67000190, 67000200, 67000210, 67000220, 67000230, 67000240, 67000250, 67000260, 67000270, 67000280, 67000290, 67000300, 67000310, 67000320, 67000330, 67000340, 67000350, 67000360, 67000370,68000010, 68000020, 68000030, 68000040, 68000050, 68000060, 68000070, 68000080, 68000090, 68000100, 68000110, 68000120, 68000130)

townname<-c("連江縣南竿鄉","連江縣北竿鄉","連江縣莒光鄉","連江縣東引鄉","金門縣金城鎮","金門縣金沙鎮","金門縣金湖鎮","金門縣金寧鄉","金門縣烈嶼鄉","金門縣烏坵鄉","宜蘭縣宜蘭市","宜蘭縣羅東鎮","宜蘭縣蘇澳鎮","宜蘭縣頭城鎮","宜蘭縣礁溪鄉","宜蘭縣壯圍鄉","宜蘭縣員山鄉","宜蘭縣冬山鄉","宜蘭縣五結鄉","宜蘭縣三星鄉","宜蘭縣大同鄉","宜蘭縣南澳鄉","新竹縣竹北市","新竹縣竹東鎮","新竹縣新埔鎮","新竹縣關西鎮","新竹縣湖口鄉","新竹縣新豐鄉","新竹縣芎林鄉","新竹縣橫山鄉","新竹縣北埔鄉","新竹縣寶山鄉","新竹縣峨眉鄉","新竹縣尖石鄉","新竹縣五峰鄉",
            "苗栗縣苗栗市","苗栗縣苑裡鎮","苗栗縣通霄鎮","苗栗縣竹南鎮","苗栗縣頭份市","苗栗縣後龍鎮","苗栗縣卓蘭鎮","苗栗縣大湖鄉","苗栗縣公館鄉","苗栗縣銅鑼鄉","苗栗縣南庄鄉","苗栗縣頭屋鄉","苗栗縣三義鄉","苗栗縣西湖鄉","苗栗縣造橋鄉","苗栗縣三灣鄉","苗栗縣獅潭鄉","苗栗縣泰安鄉","彰化縣彰化市","彰化縣鹿港鎮","彰化縣和美鎮","彰化縣線西鄉","彰化縣伸港鄉","彰化縣福興鄉","彰化縣秀水鄉","彰化縣花壇鄉","彰化縣芬園鄉","彰化縣員林市","彰化縣溪湖鎮","彰化縣田中鎮","彰化縣大村鄉","彰化縣埔鹽鄉","彰化縣埔心鄉","彰化縣永靖鄉","彰化縣社頭鄉","彰化縣二水鄉","彰化縣北斗鎮","彰化縣二林鎮","彰化縣田尾鄉","彰化縣埤頭鄉","彰化縣芳苑鄉","彰化縣大城鄉","彰化縣竹塘鄉","彰化縣溪州鄉",
            "南投縣南投市","南投縣埔里鎮","南投縣草屯鎮","南投縣竹山鎮","南投縣集集鎮","南投縣名間鄉","南投縣鹿谷鄉","南投縣中寮鄉","南投縣魚池鄉","南投縣國姓鄉","南投縣水里鄉","南投縣信義鄉","南投縣仁愛鄉","雲林縣斗六市","雲林縣斗南鎮","雲林縣虎尾鎮","雲林縣西螺鎮","雲林縣土庫鎮","雲林縣北港鎮","雲林縣古坑鄉","雲林縣大埤鄉","雲林縣莿桐鄉","雲林縣林內鄉","雲林縣二崙鄉","雲林縣崙背鄉","雲林縣麥寮鄉","雲林縣東勢鄉","雲林縣褒忠鄉","雲林縣臺西鄉","雲林縣元長鄉","雲林縣四湖鄉","雲林縣口湖鄉","雲林縣水林鄉",
            "嘉義縣太保市","嘉義縣朴子市","嘉義縣布袋鎮","嘉義縣大林鎮","嘉義縣民雄鄉","嘉義縣溪口鄉","嘉義縣新港鄉","嘉義縣六腳鄉","嘉義縣東石鄉","嘉義縣義竹鄉","嘉義縣鹿草鄉","嘉義縣水上鄉","嘉義縣中埔鄉","嘉義縣竹崎鄉","嘉義縣梅山鄉","嘉義縣番路鄉","嘉義縣大埔鄉","嘉義縣阿里山鄉","屏東縣屏東市","屏東縣潮州鎮","屏東縣東港鎮","屏東縣恆春鎮","屏東縣萬丹鄉","屏東縣長治鄉","屏東縣麟洛鄉","屏東縣九如鄉","屏東縣里港鄉","屏東縣鹽埔鄉","屏東縣高樹鄉","屏東縣萬巒鄉","屏東縣內埔鄉","屏東縣竹田鄉","屏東縣新埤鄉","屏東縣枋寮鄉","屏東縣新園鄉","屏東縣崁頂鄉","屏東縣林邊鄉","屏東縣南州鄉","屏東縣佳冬鄉","屏東縣琉球鄉","屏東縣車城鄉","屏東縣滿州鄉","屏東縣枋山鄉","屏東縣三地門鄉","屏東縣霧臺鄉","屏東縣瑪家鄉","屏東縣泰武鄉","屏東縣來義鄉","屏東縣春日鄉","屏東縣獅子鄉","屏東縣牡丹鄉",
            "臺東縣臺東市","臺東縣成功鎮","臺東縣關山鎮","臺東縣卑南鄉","臺東縣鹿野鄉","臺東縣池上鄉","臺東縣東河鄉","臺東縣長濱鄉","臺東縣太麻里鄉","臺東縣大武鄉","臺東縣綠島鄉","臺東縣海端鄉","臺東縣延平鄉","臺東縣金峰鄉","臺東縣達仁鄉","臺東縣蘭嶼鄉","花蓮縣花蓮市","花蓮縣鳳林鎮","花蓮縣玉里鎮","花蓮縣新城鄉","花蓮縣吉安鄉","花蓮縣壽豐鄉","花蓮縣光復鄉","花蓮縣豐濱鄉","花蓮縣瑞穗鄉","花蓮縣富里鄉","花蓮縣秀林鄉","花蓮縣萬榮鄉","花蓮縣卓溪鄉","澎湖縣馬公市","澎湖縣湖西鄉","澎湖縣白沙鄉","澎湖縣西嶼鄉","澎湖縣望安鄉","澎湖縣七美鄉","基隆市中正區","基隆市七堵區","基隆市暖暖區","基隆市仁愛區","基隆市中山區","基隆市安樂區","基隆市信義區","新竹市東區","新竹市北區","新竹市香山區","嘉義市東區","嘉義市西區",
            "臺北市松山區","臺北市信義區","臺北市大安區","臺北市中山區","臺北市中正區","臺北市大同區","臺北市萬華區","臺北市文山區","臺北市南港區","臺北市內湖區","臺北市士林區","臺北市北投區",
            "高雄市鹽埕區","高雄市鼓山區","高雄市左營區","高雄市楠梓區","高雄市三民區","高雄市新興區","高雄市前金區","高雄市苓雅區","高雄市前鎮區","高雄市旗津區","高雄市小港區","高雄市鳳山區","高雄市林園區","高雄市大寮區","高雄市大樹區","高雄市大社區","高雄市仁武區","高雄市鳥松區","高雄市岡山區","高雄市橋頭區","高雄市燕巢區","高雄市田寮區","高雄市阿蓮區","高雄市路竹區","高雄市湖內區","高雄市茄萣區","高雄市永安區","高雄市彌陀區","高雄市梓官區","高雄市旗山區","高雄市美濃區","高雄市六龜區","高雄市甲仙區","高雄市杉林區","高雄市內門區","高雄市茂林區","高雄市桃源區","高雄市那瑪夏區",
            "新北市板橋區","新北市三重區","新北市中和區","新北市永和區","新北市新莊區","新北市新店區","新北市樹林區","新北市鶯歌區","新北市三峽區","新北市淡水區","新北市汐止區","新北市瑞芳區","新北市土城區","新北市蘆洲區","新北市五股區","新北市泰山區","新北市林口區","新北市深坑區","新北市石碇區","新北市坪林區","新北市三芝區",
            "新北市石門區","新北市八里區","新北市平溪區","新北市雙溪區","新北市貢寮區","新北市金山區","新北市萬里區","新北市烏來區",
            "臺中市中區","臺中市東區","臺中市南區","臺中市西區","臺中市北區","臺中市西屯區","臺中市南屯區","臺中市北屯區","臺中市豐原區","臺中市東勢區","臺中市大甲區","臺中市清水區","臺中市沙鹿區","臺中市梧棲區","臺中市后里區","臺中市神岡區","臺中市潭子區","臺中市大雅區","臺中市新社區",
            "臺中市石岡區","臺中市外埔區","臺中市大安區","臺中市烏日區","臺中市大肚區","臺中市龍井區","臺中市霧峰區","臺中市太平區","臺中市大里區","臺中市和平區",
            "臺南市新營區","臺南市鹽水區","臺南市白河區","臺南市柳營區","臺南市後壁區","臺南市東山區","臺南市麻豆區","臺南市下營區","臺南市六甲區","臺南市官田區","臺南市大內區","臺南市佳里區","臺南市學甲區","臺南市西港區","臺南市七股區","臺南市將軍區","臺南市北門區","臺南市新化區","臺南市善化區","臺南市新市區","臺南市安定區","臺南市山上區","臺南市玉井區","臺南市楠西區","臺南市南化區","臺南市左鎮區","臺南市仁德區","臺南市歸仁區","臺南市關廟區","臺南市龍崎區","臺南市永康區","臺南市東區","臺南市南區","臺南市北區","臺南市安南區","臺南市安平區","臺南市中西區",
            "桃園市桃園區","桃園市中壢區","桃園市大溪區","桃園市楊梅區","桃園市蘆竹區","桃園市大園區","桃園市龜山區","桃園市八德區","桃園市龍潭區","桃園市平鎮區","桃園市新屋區","桃園市觀音區","桃園市復興區")


sheet<-c("教育","婚姻","家戶組成","年齡組別")
years<-c(2018,2019,2020)

#------------------------------------------------------------------------------
#####【county】
#檔案載入
county_all<-read_excel(str_c("220113_RA_人房地_county_all_revise.xlsx"))
#轉數字
county_all$A<-as.numeric(county_all$A)
county_all$B<-as.numeric(county_all$B)
county_all$C1<-as.numeric(county_all$C1)
county_all$C2<-as.numeric(county_all$C2)
county_all$D1<-as.numeric(county_all$D1)
county_all$D2<-as.numeric(county_all$D2)
county_all$E<-as.numeric(county_all$E)
county_all$FF<-as.numeric(county_all$FF)
county_all$NU<-as.numeric(county_all$NU)

#category名稱，要數字轉特定中文   
adj_edu<-filter(county_all,type=="教育")%>%
  mutate(adj_category=if_else(category=="1","國小與國小以下",
                              if_else(category=="2","大學以上",
                                      if_else(category=="3","大學",
                                              if_else(category=="4","高中",
                                                      if_else(category=="5","國中","未知"))))),
         order=if_else(category=="1",1,
                       if_else(category=="5",2,
                               if_else(category=="4",3,
                                       if_else(category=="3",4,
                                               if_else(category=="2",5,6))))))

adj_marriage<-filter(county_all,type=="婚姻")%>%
  mutate(adj_category=if_else(category=="1","未婚",
                              if_else(category=="2","有偶",
                                      if_else(category=="3","離婚","喪偶"))),
         order=if_else(category=="1",1,
                       if_else(category=="2",2,
                               if_else(category=="3",3,4))))

adj_house<-filter(county_all,type=="家戶組成")%>%
  mutate(adj_category=if_else(category=="1","單人",
                              if_else(category=="2","夫婦",
                                      if_else(category=="3","三代",
                                              if_else(category=="4","祖孫",
                                                      if_else(category=="5","核心",
                                                              if_else(category=="6","單親","其他")))))),
         order=if_else(category=="1",1,
                       if_else(category=="2",2,
                               if_else(category=="3",3,
                                       if_else(category=="4",4,
                                               if_else(category=="5",5,6))))))



adj_age<-filter(county_all,type=="年齡組別")%>%
  mutate(adj_category=if_else(category=="1","0  -19 ",
                              if_else(category=="2","20 - 24 ",
                                      if_else(category=="3","25 - 29 ",
                                              if_else(category=="4","30 - 34 ",
                                                      if_else(category=="5","35 - 39",
                                                              if_else(category=="6","40 - 44 ",
                                                                      if_else(category=="7","45 - 49 ",
                                                                              if_else(category=="8","50 - 54 ",
                                                                                      if_else(category=="9","55 - 59 ",
                                                                                              if_else(category=="10","60 - 64 ",
                                                                                                      if_else(category=="11","65 - 69 ",
                                                                                                              if_else(category=="12","70 - 74",
                                                                                                                      if_else(category=="13","75 - 79 ",
                                                                                                                              if_else(category=="14","80 - 84 ",
                                                                                                                                      if_else(category=="15","85 - 89 ","90+"))))))))))))))),
         order=if_else(category=="1",1,
                       if_else(category=="2",2,
                               if_else(category=="3",3,
                                       if_else(category=="4",4,
                                               if_else(category=="5",5,
                                                       if_else(category=="6",6,
                                                               if_else(category=="7",7,
                                                                       if_else(category=="8",8,
                                                                               if_else(category=="9",9,
                                                                                       if_else(category=="10",10,
                                                                                               if_else(category=="11",11,
                                                                                                       if_else(category=="12",12,
                                                                                                               if_else(category=="13",13,
                                                                                                                       if_else(category=="14",14,
                                                                                                                               if_else(category=="15",15,16))))))))))))))))
#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#合併已改名的category回到county_all 
county_all_adj<-bind_rows(adj_edu,adj_marriage,adj_house,adj_age)

#------------------------------------------------------------------------------
########county-109
#開始loop
list<-list()
for (j in 1:4){
  list[[j]]<-list()
}
for (j in 1:4) {
  for (i in 1:22) {
    list[[j]][[i]]<-filter(county_all_adj,code==countycode[i],type==sheet[j],year==2020)%>%
      mutate(a= A,
             aa= percent(A/(A+C1+C2+D1+D2+E+FF)),
             b= C1+D1,
             bb= percent((C1+D1)/(A+C1+C2+D1+D2+E+FF)),
             c= C2+D2,
             cc= percent((C2+D2)/(A+C1+C2+D1+D2+E+FF)),
             d= E+FF,
             dd= percent((E+FF)/(A+C1+C2+D1+D2+E+FF)),
             e= A+C1+C2+D1+D2+E+FF,
             ee= percent(e/(e+B+NU)),
             f= B,
             ff= percent(B/(e+B+NU)),
             g= NU,
             gg= percent(NU/(e+B+NU)),
             blank=c(" "),
             county2=county,
             code2=code,
             type2=type,
             year2=year)%>%
      arrange(type2,order)%>%
      subset(select = c(-category,-A, -B, -C1,-C2,-D1,-D2,-E,-FF,-NU,
                        -year,-county,-code,-type,-order))%>%
      rbind(Newrow=c(" "),c(" "),c(" "),c(" "),c(" "),c(" "))%>%
      rbind(Newrow=c(str_c("109年度擁屋型態 按",sheet[j],"分類[",countyname[i+1],"]"),
                     " "," "," "," "," "," "," "," ",
                     " "," "," "," "," "," "," "," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(sheet[j],"擁屋者"," "," "," "," "," "," "," "," "," ",
                     "無屋者"," ","其他"," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","(a)"," ","(b)"," ","(c)"," ","(d)"," ","(e)"," ","(f)"," ","(g)"
                     ," "," "," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","本人持有"," ","同戶親屬持有"," ","非同戶親屬持有"," ","擁屋但住宅非本人或親屬持有",
                     " ","整體擁屋(a+b+c+d)"," ",""," ",""," "," "," "," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","n","%","n","%","n","%","n","%","n","%","n","%","n","%"," "," "," "," "))
    
  }
}
#整合&輸出
county_109_table<-bind_rows(list)
write_xlsx(county_109_table,"220114_RA_人房地_county_table_109.xlsx")

#------------------------------------------------------------------------------
########county-108
#開始loop
list<-list()
for (j in 1:4){
  list[[j]]<-list()
}
for (j in 1:4) {
  for (i in 1:22) {
    list[[j]][[i]]<-filter(county_all_adj,code==countycode[i],type==sheet[j],year==2019)%>%
      mutate(a= A,
             aa= percent(A/(A+C1+C2+D1+D2+E+FF)),
             b= C1+D1,
             bb= percent((C1+D1)/(A+C1+C2+D1+D2+E+FF)),
             c= C2+D2,
             cc= percent((C2+D2)/(A+C1+C2+D1+D2+E+FF)),
             d= E+FF,
             dd= percent((E+FF)/(A+C1+C2+D1+D2+E+FF)),
             e= A+C1+C2+D1+D2+E+FF,
             ee= percent(e/(e+B+NU)),
             f= B,
             ff= percent(B/(e+B+NU)),
             g= NU,
             gg= percent(NU/(e+B+NU)),
             blank=c(" "),
             county2=county,
             code2=code,
             type2=type,
             year2=year)%>%
      arrange(type2,order)%>%
      subset(select = c(-category,-A, -B, -C1,-C2,-D1,-D2,-E,-FF,-NU,
                        -year,-county,-code,-type,-order))%>%
      rbind(Newrow=c(" "),c(" "),c(" "),c(" "),c(" "),c(" "))%>%
      rbind(Newrow=c(str_c("108年度擁屋型態 按",sheet[j],"分類[",countyname[i+1],"]"),
                     " "," "," "," "," "," "," "," ",
                     " "," "," "," "," "," "," "," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(sheet[j],"擁屋者"," "," "," "," "," "," "," "," "," ",
                     "無屋者"," ","其他"," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","(a)"," ","(b)"," ","(c)"," ","(d)"," ","(e)"," ","(f)"," ","(g)"
                     ," "," "," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","本人持有"," ","同戶親屬持有"," ","非同戶親屬持有"," ","擁屋但住宅非本人或親屬持有",
                     " ","整體擁屋(a+b+c+d)"," ",""," ",""," "," "," "," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","n","%","n","%","n","%","n","%","n","%","n","%","n","%"," "," "," "," "))
    
  }
}
#整合&輸出
county_108_table<-bind_rows(list)
write_xlsx(county_108_table,"220114_RA_人房地_county_table_108.xlsx")

#------------------------------------------------------------------------------
########county-107
#開始loop
list<-list()
for (j in 1:4){
  list[[j]]<-list()
}
for (j in 1:4) {
  for (i in 1:22) {
    list[[j]][[i]]<-filter(county_all_adj,code==countycode[i],type==sheet[j],year==2018)%>%
      mutate(a= A,
             aa= percent(A/(A+C1+C2+D1+D2+E+FF)),
             b= C1+D1,
             bb= percent((C1+D1)/(A+C1+C2+D1+D2+E+FF)),
             c= C2+D2,
             cc= percent((C2+D2)/(A+C1+C2+D1+D2+E+FF)),
             d= E+FF,
             dd= percent((E+FF)/(A+C1+C2+D1+D2+E+FF)),
             e= A+C1+C2+D1+D2+E+FF,
             ee= percent(e/(e+B+NU)),
             f= B,
             ff= percent(B/(e+B+NU)),
             g= NU,
             gg= percent(NU/(e+B+NU)),
             blank=c(" "),
             county2=county,
             code2=code,
             type2=type,
             year2=year)%>%
      arrange(type2,order)%>%
      subset(select = c(-category,-A, -B, -C1,-C2,-D1,-D2,-E,-FF,-NU,
                        -year,-county,-code,-type,-order))%>%
      rbind(Newrow=c(" "),c(" "),c(" "),c(" "),c(" "),c(" "))%>%
      rbind(Newrow=c(str_c("107年度擁屋型態 按",sheet[j],"分類[",countyname[i+1],"]"),
                     " "," "," "," "," "," "," "," ",
                     " "," "," "," "," "," "," "," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(sheet[j],"擁屋者"," "," "," "," "," "," "," "," "," ",
                     "無屋者"," ","其他"," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","(a)"," ","(b)"," ","(c)"," ","(d)"," ","(e)"," ","(f)"," ","(g)"
                     ," "," "," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","本人持有"," ","同戶親屬持有"," ","非同戶親屬持有"," ","擁屋但住宅非本人或親屬持有",
                     " ","整體擁屋(a+b+c+d)"," ",""," ",""," "," "," "," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","n","%","n","%","n","%","n","%","n","%","n","%","n","%"," "," "," "," "))
    
  }
}
#整合&輸出
county_107_table<-bind_rows(list)
write_xlsx(county_107_table,"220114_RA_人房地_county_table_107.xlsx")

#------------------------------------------------------------------------------
#####【TW】
#檔案載入
tw_all<-read_excel(str_c("220110_RA_人房地_tw_all.xlsx"))
#轉數字
tw_all$A<-as.numeric(tw_all$A)
tw_all$B<-as.numeric(tw_all$B)
tw_all$C1<-as.numeric(tw_all$C1)
tw_all$C2<-as.numeric(tw_all$C2)
tw_all$D1<-as.numeric(tw_all$D1)
tw_all$D2<-as.numeric(tw_all$D2)
tw_all$E<-as.numeric(tw_all$E)
tw_all$FF<-as.numeric(tw_all$FF)
tw_all$NU<-as.numeric(tw_all$NU)

#category名稱，要數字轉特定中文   
adj_edu_tw<-filter(tw_all,type=="教育")%>%
  mutate(adj_category=if_else(category=="1","國小與國小以下",
                              if_else(category=="2","大學以上",
                                      if_else(category=="3","大學",
                                              if_else(category=="4","高中",
                                                      if_else(category=="5","國中","未知"))))),
         order=if_else(category=="1",1,
                       if_else(category=="5",2,
                               if_else(category=="4",3,
                                       if_else(category=="3",4,
                                               if_else(category=="2",5,6))))))

adj_marriage_tw<-filter(tw_all,type=="婚姻")%>%
  mutate(adj_category=if_else(category=="1","未婚",
                              if_else(category=="2","有偶",
                                      if_else(category=="3","離婚","喪偶"))),
         order=if_else(category=="1",1,
                       if_else(category=="2",2,
                               if_else(category=="3",3,4))))

adj_house_tw<-filter(tw_all,type=="家戶組成")%>%
  mutate(adj_category=if_else(category=="1","單人",
                              if_else(category=="2","夫婦",
                                      if_else(category=="3","三代",
                                              if_else(category=="4","祖孫",
                                                      if_else(category=="5","核心",
                                                              if_else(category=="6","單親","其他")))))),
         order=if_else(category=="1",1,
                       if_else(category=="2",2,
                               if_else(category=="3",3,
                                       if_else(category=="4",4,
                                               if_else(category=="5",5,6))))))



adj_age_tw<-filter(tw_all,type=="年齡組別")%>%
  mutate(adj_category=if_else(category=="1","0  -19 ",
                              if_else(category=="2","20 - 24 ",
                                      if_else(category=="3","25 - 29 ",
                                              if_else(category=="4","30 - 34 ",
                                                      if_else(category=="5","35 - 39",
                                                              if_else(category=="6","40 - 44 ",
                                                                      if_else(category=="7","45 - 49 ",
                                                                              if_else(category=="8","50 - 54 ",
                                                                                      if_else(category=="9","55 - 59 ",
                                                                                              if_else(category=="10","60 - 64 ",
                                                                                                      if_else(category=="11","65 - 69 ",
                                                                                                              if_else(category=="12","70 - 74",
                                                                                                                      if_else(category=="13","75 - 79 ",
                                                                                                                              if_else(category=="14","80 - 84 ",
                                                                                                                                      if_else(category=="15","85 - 89 ","90+"))))))))))))))),
         order=if_else(category=="1",1,
                       if_else(category=="2",2,
                               if_else(category=="3",3,
                                       if_else(category=="4",4,
                                               if_else(category=="5",5,
                                                       if_else(category=="6",6,
                                                               if_else(category=="7",7,
                                                                       if_else(category=="8",8,
                                                                               if_else(category=="9",9,
                                                                                       if_else(category=="10",10,
                                                                                               if_else(category=="11",11,
                                                                                                       if_else(category=="12",12,
                                                                                                               if_else(category=="13",13,
                                                                                                                       if_else(category=="14",14,
                                                                                                                               if_else(category=="15",15,16))))))))))))))))
#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#合併已改名的category回到county_all 
tw_all_adj<-bind_rows(adj_edu_tw,adj_marriage_tw,adj_house_tw,adj_age_tw)

#------------------------------------------------------------------------------
###tw--107~109
#開始loop
list<-list()
for (j in 1:3){
  list[[j]]<-list()
}
for (j in 1:3) {
  for (i in 1:4) {
    list[[j]][[i]]<-filter(tw_all_adj,type==sheet[i],year==years[j])%>%
      mutate(a= A,
             aa= percent(A/(A+C1+C2+D1+D2+E+FF)),
             b= C1+D1,
             bb= percent((C1+D1)/(A+C1+C2+D1+D2+E+FF)),
             c= C2+D2,
             cc= percent((C2+D2)/(A+C1+C2+D1+D2+E+FF)),
             d= E+FF,
             dd= percent((E+FF)/(A+C1+C2+D1+D2+E+FF)),
             e= A+C1+C2+D1+D2+E+FF,
             ee= percent(e/(e+B+NU)),
             f= B,
             ff= percent(B/(e+B+NU)),
             g= NU,
             gg= percent(NU/(e+B+NU)),
             blank=c(" "),
             county2=county,
             type2=type,
             year2=year)%>%
      arrange(type2, order)%>%
      subset(select = c(-category, -A, -B, -C1,-C2,-D1,-D2,-E,-FF,-NU,
                        -year,-county,-type,-order))%>%
      rbind(Newrow=c(" "),c(" "),c(" "),c(" "),c(" "),c(" "))%>%
      rbind(Newrow=c(years[j]-1911,"年度擁屋型態按"," "," "," "," "," "," "," "," ",
                     " "," "," "," "," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","擁屋者"," "," "," "," "," "," "," "," "," ",
                     "無屋者"," ","其他"," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","(a)"," ","(b)"," ","(c)"," ","(d)"," ","(e)"," ","(f)"," ","(g)"
                     ," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","本人持有"," ","同戶親屬持有"," ","非同戶親屬持有"," ","擁屋但住宅非本人或親屬持有",
                     " ","整體擁屋(a+b+c+d)"," ",""," ",""," "," "," "," "," "," "," "," "," "," "))%>%
      rbind(Newrow=c(" ","n","%","n","%","n","%","n","%","n","%","n","%","n","%"," "," "," "," "))
    
  }
}
#整合&輸出
tw_107to109_table<-bind_rows(list)
write_xlsx(tw_107to109_table,"220114_RA_人房地_tw_107to109.xlsx")